# Enable verbose mode
ARGV << '-v'

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'unofficial-cask/hashicorp-tap'

cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'vlc'
cask 'evernote'
cask 'google-drive'
cask 'vagrant'
cask 'keybase'
cask 'virtualbox'
cask 'adium'
cask 'sourcetree'
cask 'silverlight'

brew 'wget'
brew 'ack'
brew 'dark-mode'
brew 'git'
brew 'git-lfs'
brew 'zsh'
brew 'go'
brew 'jq'
brew 'gpg'
brew 'binutils'
brew 'vim'
brew 'tig'
brew 'tmux'
brew 'asciinema'
brew 'packer'
brew 'terraform'
brew 'pidgin'
brew 'kubernetes-helm'
brew 'kubernetes-cli'
brew 'zsh'