# Enable verbose mode
# ARGV << '-v'

cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'instrumenta/instrumenta'
tap 'aquasecurity/trivy'

cask 'alacritty'
cask 'brooklyn'
cask 'caffeine'
cask 'cheatsheet'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'zoomus'

brew 'ack'
brew 'awscli'
brew 'fluxctl'
brew 'fzf'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'hub'
brew 'hugo'
brew 'ipcalc'
brew 'istioctl'
brew 'jq'
brew 'kubectl'
brew 'kubernetes-helm'
brew 'kubeval'
brew 'kustomize'
brew 'kind'
brew 'make'
brew 'stow'
brew 'tfenv'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'trivy'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'
brew 'zsh-completions'
